app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?)  [["email", "singhyuvi973@gmail.com"], ["created_at", "2023-09-19 06:51:49.657601"], ["updated_at", "2023-09-19 06:51:49.657601"], ["password", "[FILTERED]"]]
---
  def create
    @user = User.new(user_params)
    if @user.save